# IsStackedWall Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Wall..::..IsStackedWall Property
Wall Class See Also
---
Identifies if the wall is a stacked wall.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool IsStackedWall { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsStackedWall As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsStackedWall {
	bool get ();
}
```

# See Also
Wall Class
Autodesk.Revit.DB Namespace